#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8fb056e-3ea6-4d96-8129-f4346b659e91]
module.keycloak_test.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=97bed9dd-e375-4d3a-ac4b-4def5fe430b6]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5429f84b-e3c8-494c-8c77-05c27887609a]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ee484ead-bfaf-4e7b-936a-428db8dd2184]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4f3f5cd9-b6d2-42fd-bacb-efa12781f492]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3a8493f4-71f7-4861-9745-379e307e1361]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a122f0b5-ec48-41f9-a869-12afe4c33a3b]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4b822b48-8674-47cd-ae8c-bf2de27a25b6]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b62befee-13bf-43d9-b574-a31ce9685301]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7d3241ce-aede-4a00-b2cc-cfaa04666ee5]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=823b42e2-b1c2-4752-83f6-a32f4eff3ca9]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=25031dab-8d93-4487-a197-0f8797ab5690]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3d097586-7bc1-43cd-9a69-4d9d28d1f3b1]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9df919f6-99ab-457d-a1a6-d9798ee9bff5]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0e52a27-c642-424b-850e-8b9db6668bc9]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9b71b9b4-2ce6-4190-a861-fde15e62681f]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=61b51f18-b6ea-4162-a0f4-e6e96efbb50d]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=abc4bfa3-f5d9-4e4b-b6f5-0b15a104a987]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=01e07da7-c7dc-4cf3-9d39-e6d3b818f3b5]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c2e355e0-b52f-49b2-a0fd-8e45f14623e9]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f13013d-2f89-4d34-bc28-92f8bc2f8aec]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ebf7510b-2c8d-4823-a842-1ef2e5d422c7]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=acaf055b-7a1c-4cff-9e79-5660e0cd5a9f]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cb0d0e0a-2f5f-408a-88ce-b13f2041dc2a]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0a76b429-a810-4915-8b34-44c25abb1c83]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3c515f9a-b6ec-4dad-9ff0-4667f8b71fb6]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=501b7bca-0bb6-4c47-9117-bf7c198da856]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a68c05a8-2fd1-4aa8-bccd-0d4dc507bc8e]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c9f3b0e2-bc88-49c1-9863-3414a2cb4a79]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5faab98-04eb-469f-b1a4-bf4c4fbe9478]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6371aa88-9047-43f0-8b5d-43ce1fc60241]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3dd41f1b-e207-443e-b8d3-cf9946565ff5]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ced38f6e-9e3c-4b2e-8194-93854afb9030]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6dc52ff6-3381-4900-b272-4819d183ba03]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=199df10e-daf5-4ee8-8f6a-a150fdab68c1]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cebbc3f8-eeff-47cb-8e10-ff6a7756a208]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0bce5a19-b7c5-4478-b25f-473be97c3ebf]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6ed554bd-d131-42db-a717-564e14e1d0d3]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0e28276a-a47c-466a-9fae-a5c9ddcf731f]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=851dcaf5-3f07-4ec0-a372-942d17f56886]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e9cb28fe-e149-4b71-ab6b-dcca82724882]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1466c781-a06b-4341-8609-2d6c8b094e4f]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7a053e7d-eb39-4181-aa3c-bd345eb19f83]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=25b5beb0-871c-4ca5-8b06-fcf3b629f729]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=776cb2be-c253-4aba-ab41-0d07c5304167]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8878cff1-1348-4e40-ac4c-e86cbef10953]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=acfa69d8-7904-4142-8e82-217b60cd9045]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4b691815-680a-40ef-9e08-df1c9968c0fc]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8793c98f-faaa-494f-b0d6-f70eddff4110]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a8fcd62-601e-4cfc-a547-5ba48fa7e66a]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=88d1a623-39ab-42c0-8257-e47b209da2dc]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73c0c364-21b0-4b46-a6d4-c3c890a1481d]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d9e4c5ec-c3a3-4a06-82d7-e8e68d1e8236]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a980f149-9a3e-4c6a-8149-70c3196be838]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65ebcb36-21f5-4b3f-87ce-1f8c3041d1d1]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ea55037b-e1ef-488a-a9bb-369203ac1e54]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a4038a18-7e89-4d5e-969f-c5d160540867]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95a80664-1e47-4a39-b50e-80213d5a4ec7]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=63dbdba0-7fd9-4250-b5f1-34e82b06cfd5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=730c7919-42d5-4016-bb52-785cf12f4ae4]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c73d46d8-f273-407e-832e-5c19f5d337d0]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0964a154-2cf8-4eed-a061-8c5b8839090b]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d191c0be-d2b3-4270-a403-fbef89d05707]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=03975245-a356-4534-b7fb-9785adb765f5]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=250f8222-db76-469b-9379-e97c9df7970f]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5e43537d-44da-4dd0-9627-c97d2b19ecc6]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=400e247f-98d9-4a7a-8494-d32a81226d15]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7bd5b16c-fefe-4e95-a641-0f75dc0c47a5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7745dbee-3336-4404-aa78-c2d67d1c4958]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16f0a6f9-b53b-42c1-a9ae-f25094901d27]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bd93bf1a-1da7-4794-9068-f8039a487114]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d4041a7f-970a-4b02-8ca1-318a779f28d7]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=98a68b31-516c-47eb-9a8d-b753d24873a8]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d939d3b4-e962-4aea-a653-2e5aeb16b57c]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e64a3f75-96b4-4a39-b0e5-8d899cc20e64]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75c5ce43-21c0-4adc-9c88-b67094370396]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30f6ac74-bca2-47bd-af4e-e99340d9f388]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=14f3dc3a-cfcd-436b-b267-2a181961b625]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=11740a6d-e1bc-4358-b69b-d20c40ad6ede]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d9f74a4f-67b0-48bf-a02c-404a54728572]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=935ff7cb-a126-4216-ad71-45da47f82ac5]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d7ad910e-c22c-4eed-8efc-39d6d6f9edfa]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb437a3f-248d-480b-b6e9-03618f1baea6]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=16612e69-694a-4be4-b9e4-5d370f01471a]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bcf65c-da6e-4f30-b363-a912f862f75b]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ad9328cc-f535-4f7f-869f-207443949070]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4cd357f0-ebcc-4204-a6e6-2b29c134640a]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=af7a9529-fc8f-448b-a72a-fbea17332ae9]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4f96870d-1101-4885-aed0-80c10b9fcabc]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f5e1694c-651c-4666-b9b5-a1a8f974eff3]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bf4197d2-3acf-4620-8d0e-fa9b8c34bd76]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f3b9b2ad-05d2-4ecb-82e9-9e69ab649419]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=658cca28-98f3-46a0-a966-3272639b067a]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c78d5e3a-73a8-4137-8c7c-2c1d061c0e1b]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fb368ed5-3abd-401e-a6ae-6cf62c4b24da]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=969b3fa5-e0ad-4abf-b174-10e196c49a33]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8c49c59-f256-4909-9167-23e1cd3c8cf3]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3a6e647f-57d7-432f-8cf6-a96be9ff1bef]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=967a8f14-638d-4c73-808b-842b9701c9a4]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f979fd85-0a91-4d13-97bb-bddadfb64c7a]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9b7f55bc-86a8-48f1-b261-d77dafd367b3]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=35797f78-539e-4102-8429-430d2bf6ee33]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d62ae980-fdab-4e27-9975-f07113f1abb1]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ec0b9301-0538-483c-88dc-a595bf7e526c]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2f1a394e-5a59-45bb-a53e-bb69f90eb0bd]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b817d154-46b3-4078-a50c-5765d259e5b3]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=df2519c4-4fd4-460c-87c5-0ab8f55ed1e0]
module.keycloak_test.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3128b3ba-a4d5-4dc3-b88f-ffe2dc7d380f]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=19edff30-b790-4d65-830a-2ec8d88b2c06]
module.keycloak_test.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80848e63-52f0-452d-8cce-c7bfa2d50ad2]
module.keycloak_test.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=494b645c-e1a3-4792-bc66-67d15ba24d00]
module.keycloak_test.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=178d1e92-932b-4d05-b160-38539be3b3d7]
module.keycloak_test.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=15bda7d2-1074-462f-8a2a-6c80a0a6b1fd]
module.keycloak_test.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c25bf6b2-7aa4-4e9a-9478-3023e0b7918d]
module.keycloak_test.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f589de24-6601-4f0b-9cd4-64516b6ae2cd]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8107ee32-87f3-41eb-bb21-3df0944b94b8]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=41c46f80-61a5-491e-9fa7-1f9b07bb9e24]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a7bad6d8-cc3c-4763-bdbe-9cf77cf18e1f]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bec9b68d-164e-431a-9bf5-0561bf500918]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a2f017db-b2a3-4268-8eca-d00780a0fbee]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eb404028-dc05-4845-ba5d-c639101b3d5b]
module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=63db881e-acf6-46d1-83a6-4bd59d94e5d0]
module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=404d934b-fd40-44ee-ad8a-aaa93c00824c]
module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4524cae1-efd5-43d4-8aa1-6aebb592842f]
module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=56142402-7c34-45c7-b545-2dad32de5a1b]
module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bf8dfb34-aea6-4641-a149-e670e6dedb67]
module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9c3c425f-bbc5-4374-a1e1-80b0dd53fd1f]
module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b7da2d4-568f-4e81-8435-8bc87a4a5430]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "f1c6214c-357c-4fad-a8b9-34f874bd6b89"
        name                                     = "nov-16-3204"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "fb058d58-ab61-47e7-8241-bac9a0b6fbef"
        name                                     = "nov-16-3204"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-3205"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-3205"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-3205"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-3205"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://dev",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-3205"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-3205"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-3205.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-3205"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-3205"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3000 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*